@echo off
rem ************************************************************************************************
rem Åöì¸óÕÉ`ÉFÉbÉN
rem ************************************************************************************************
rem ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
rem Å°AppStdLibÇÃDebug::LogÇóòópÇ∑ÇÈÇ©Ç«Ç§Ç©
rem ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
if not exist "IsUseAslLog.cmd" if "%IsUseAslLog%"=="ïœçXÇµÇ»Ç¢" (
	set IsUseAslLog=true
	rem echo ÅuIsUseAslLogÅvÇÃì¸óÕÇÕïKê{Ç≈Ç∑ÅB
	rem exit -1
)
rem ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
rem ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
rem Å°System::EntryPointÇóòópÇ∑ÇÈÇ©Ç«Ç§Ç©
rem ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
if not exist "IsUseEntryPointClass.cmd" if "%IsUseEntryPointClass%"=="ïœçXÇµÇ»Ç¢" (
	set IsUseEntryPointClass=true
	rem echo ÅuIsUseEntryPointClassÅvÇÃì¸óÕÇÕïKê{Ç≈Ç∑ÅB
	rem exit -1
)
rem ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
rem ************************************************************************************************

rem ************************************************************************************************
rem Åöê›íËämîF
rem ************************************************************************************************
echo ê›íËÇÃämîFíÜ...
rem ------------------------------------------------------------------------------------------------
if not exist "..\jenkins_settings.cmd" (
	echo ã§í ê›íËÇ™ê∂ê¨Ç≥ÇÍÇƒÇ¢Ç‹ÇπÇÒÅB
	echo Åunew_generatorÅvÇÃÉWÉáÉuÇ≈GeneratorÇÃêVãKçÏê¨ÇçsÇ»Ç¡ÇƒÇ≠ÇæÇ≥Ç¢ÅB
	exit -1
)
rem ************************************************************************************************

rem ************************************************************************************************
rem ÅöèââÒèàóù
rem ************************************************************************************************
call ..\jenkins_settings.cmd
rem ------------------------------------------------------------------------------------------------
set PATH=%PATH%;%LibDirPath%
rem ************************************************************************************************


rem Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`
rem Å´ÉÅÉCÉìèàóù

rem ************************************************************************************************
rem ÅöäeéÌê›íËÇÃèëÇ´èoÇµ
rem ************************************************************************************************
rem ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
rem Å°ì¸óÕÇ≥ÇÍÇΩílånÅ¶ë∂ç›ämîFïsóvån
rem ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
if not "%IsUseAslLog%"=="ïœçXÇµÇ»Ç¢" echo set IsUseAslLog=%IsUseAslLog%>IsUseAslLog.cmd
if not "%IsUseAslLog%"=="ïœçXÇµÇ»Ç¢" echo ÅuIsUseAslLogÅvê›íËäÆóπÅB[IsUseAslLog:%IsUseAslLog%]
if not "%IsUseEntryPointClass%"=="ïœçXÇµÇ»Ç¢" echo set IsUseEntryPointClass=%IsUseEntryPointClass%>IsUseEntryPointClass.cmd
if not "%IsUseEntryPointClass%"=="ïœçXÇµÇ»Ç¢" echo ÅuIsUseEntryPointClassÅvê›íËäÆóπÅB[IsUseEntryPointClass:%IsUseEntryPointClass%]
rem ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
rem ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
rem Å°ÉRÅ[ÉhÉeÉìÉvÉåÅ[ÉgÉtÉHÉãÉ_ÉpÉX
rem ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
if not exist "%CppDirPath%\template\." (
	echo ÉRÅ[ÉhÉeÉìÉvÉåÅ[ÉgÉtÉHÉãÉ_ÉpÉXÇ™å©Ç¬Ç©ÇËÇ‹ÇπÇÒÅB
	echo ê›íËÇ≥ÇÍÇΩílÅF%CppDirPath%\template
	exit -1
)
echo set CppTemplateDirPath=%CppDirPath%\template>CppTemplateDirPath.cmd
echo ÅuCppTemplateDirPathÅvê›íËäÆóπÅB[CppTemplateDirPath:%CppDirPath%\template]
rem ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
rem ************************************************************************************************

rem ************************************************************************************************
rem ÅöëSÇƒÇÃê›íËÇÃåãçá
rem ************************************************************************************************
copy IsUseAslLog.cmd cpp_settings_common.cmd /Y
copy cpp_settings_common.cmd+CppTemplateDirPath.cmd cpp_settings_common.cmd /B /Y
copy cpp_settings_common.cmd+IsUseEntryPointClass.cmd cpp_settings_common.cmd /B /Y
rem ************************************************************************************************


rem Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`
rem Å´èIóπèàóù

rem ************************************************************************************************
rem ÅöäÆóπÉÅÉbÉZÅ[ÉW
rem ************************************************************************************************
rem ************************************************************************************************
